/*********************************************************************************************************
* 模块名称：ADC.c
* 摘    要：ADC模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "ADC.h"
#include "gd32f4xx.h"
#include "gd32f4xx_adc.h"
#include "gd32f4xx_gpio.h"
#include "gd32f4xx_rcu.h"
#include "SEGGER_RTT.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigADC0(void); //配置ADC0

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigADC0
* 函数功能：配置ADC0
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ConfigADC0(void)//PA1
{

  //使能RCU相关时钟
  rcu_periph_clock_enable(RCU_GPIOA);  //使能GPIOA的时钟
  rcu_periph_clock_enable(RCU_ADC0);   //使能ADC0的时钟
  
  //配置ADC时钟RCU_CKADC_CKAPB2_DIV6
  adc_clock_config(ADC_ADCCK_PCLK2_DIV6);
  
  //设置PA1为模拟输入
  gpio_mode_set(GPIOA,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,GPIO_PIN_1);
  gpio_output_options_set(GPIOA,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,GPIO_PIN_1);

  //所有ADC独立工作
  adc_sync_mode_config(ADC_SYNC_MODE_INDEPENDENT);

  //配置ADC0 
  adc_deinit();                                                                            //复位ADC0
  adc_special_function_config(ADC0, ADC_SCAN_MODE, DISABLE);                                    //禁用ADC扫描
  adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, DISABLE);                              //禁用连续采样
  adc_dma_mode_disable(ADC0);                                                                   //禁用DMA
  adc_resolution_config(ADC0, ADC_RESOLUTION_12B);                                              //规则组配置，12位分辨率
  adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);                                         //右对齐
  adc_channel_length_config(ADC0, ADC_ROUTINE_CHANNEL, 1);                                      //规则组长度为1，即ADC通道数量为1
  adc_routine_channel_config(ADC0, 0, ADC_CHANNEL_1 ,ADC_SAMPLETIME_15);                 //ADC0_CH1采样顺序ADC_SAMPLETIME_239POINT5
  adc_external_trigger_config(ADC0, ADC_ROUTINE_CHANNEL, ENABLE);                               //规则组使能外部触发
  adc_external_trigger_source_config(ADC0, ADC_ROUTINE_CHANNEL, EXTERNAL_TRIGGER_DISABLE); //规则组使用软件触发

  //ADC0过采样配置，左移4位后ADC分辨率扩展到16位，连续采256次后求平均(过采样要花3ms，时间有点长)
  //adc_oversample_mode_config(ADC0, ADC_OVERSAMPLING_ALL_CONVERT, ADC_OVERSAMPLING_SHIFT_4B, ADC_OVERSAMPLING_RATIO_MUL256);
  //adc_oversample_mode_enable(ADC0);
  adc_oversample_mode_disable(ADC0);

  //ADC0使能
  adc_enable(ADC0);

  //使能ADC0校准
  adc_calibration_enable(ADC0);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitADC
* 函数功能：初始化ADC模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitADC(void)
{
  ConfigADC0();  //ADC0
}

/*********************************************************************************************************
* 函数名称：GetADC
* 函数功能：获取ADC采样值
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：过采样处理使得ADC分辨率由原来的12位扩展到16位
*********************************************************************************************************/
u16 GetADC(void)
{
  u16 adc;

  //规则组软件触发
  adc_software_trigger_enable(ADC0, ADC_ROUTINE_CHANNEL);

  //等待ADC转换完成
  while(!adc_flag_get(ADC0, ADC_FLAG_EOC));

  //获取规则组ADC转换结果
  adc = adc_routine_data_read(ADC0);
  //SEGGER_RTT_printf(0, "ADC - %d\r\n",adc);
  return adc;
}
